# Schema Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
Field..::..Schema Property
Field Class See Also
---
The Schema to which this Field belongs.
**Namespace:** Autodesk.Revit.DB.ExtensibleStorage**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public Schema Schema { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Schema As Schema
	Get
```

Visual C++
---
```text
public:
property Schema^ Schema {
	Schema^ get ();
}
```

# See Also
Field Class
Autodesk.Revit.DB.ExtensibleStorage Namespace